Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K48A.tmx
Source language: en_us
Languages: zh_cn

source: The Archipelago
zh_cn: 群岛

source: In the remote southern seas there is a cluster of islands.
zh_cn: 在遥远的南方海域上有一群岛屿。

source: The weather is fair, the land is fertile and the ocean is rich with fish.
zh_cn: 气候宜人，土地肥沃，海洋里盛产鱼类。

source: Each island is inhabited by a different race of people.
zh_cn: 每一个岛屿上都居住着一个不同的种族。

source: Although physically they look alike, you can tell them apart by their styles of dress, their distinctive dialects and even their most casual gestures.
zh_cn: 尽管他们在身形外貌上非常相似，但是可以通过他们的着装风格、他们与众不同的方言、甚至他们最不经意的动作姿态把他们区别开。

source: A cursory tour of the archipelago reveals that each island has its own unique form of architecture.
zh_cn: 粗略地游览一下这个群岛就会发现，每一个岛屿都有它独特的建筑形式。

source: If there is any similarity between them, it is that each race builds in a manner that is stubbornly at odds with the immediate environment.
zh_cn: 如果说它们之间有什么类似之处的话，那就是每一个种族的建造方式都是与邻近环境不合情理地相悖。

source: On rocky hillsides there are wooden huts and in wooded valleys, towns of brick.
zh_cn: 在多岩石的山坡上有木制的小屋，而在树木繁茂的山谷有砖建的城镇。

source: Arid uplands are irrigated and planted with leafy gardens, whereas, on fertile plains, the parks are paved with stone.
zh_cn: 在干旱的高地上引水灌溉，种植阔叶园林；然而在肥沃的平原上，公园里铺着石头。

source: On windswept outposts people live in tents but in the most sheltered regions they have stout, resilient cottages.
zh_cn: 在受风吹袭的边区村落，人们居住在帐篷里；而在最受庇护的地区，他们有坚固的、能复原的村舍。

source: Despite their differences, the islanders coexist peacefully.
zh_cn: 尽管他们有差异，岛上居民还是和平共处。

source: There is rivalry over certain fishing waters and sporting prowess but it rarely amounts to more than a few heated exchanges.
zh_cn: 虽然在某些捕鱼水域和体育实力上有竞争，但很少达到超过几次激烈争吵的程度。

source: Distances between the islands are not great and the sea is calm but people prefer to stick with their own kind and mixed marriages are rare.
zh_cn: 岛屿之间的距离并不远，海洋也平静，但人们更喜欢与自己的同类在一起，异族通婚很少见。

source: For the most part, the only contact between the different races is for trading purposes.
zh_cn: 在大多数情况下，不同种族间的唯一联系是为了贸易。

source: At the centre of the archipelago, perhaps in the most favoured spot of all, lies an island that has been deserted for many generations.
zh_cn: 在群岛的中央，大概是位于所有场所中最有利的地点，有一座被废弃了好几代的岛屿。

source: There is no obvious reason for its abandonment; it has good soil, plenty of freshwater, two natural ports and a climate no more or less suitable to the raising of crops than its neighbour's.
zh_cn: 对于它的被弃，没有很明显的原因；它有优良的土壤，充足的淡水，两个天然港口，以及比它的邻居不多也不少适合种植庄稼的气候。

source: But no birds circle overhead and no lights come on in the evenings.
zh_cn: 但是没有鸟在上空盘旋，晚上也没有灯光亮起。

source: It has not always been like this.
zh_cn: 它不是一直这样的。

source: Long ago, it was inhabited by farmers and fishermen much like everywhere else in the archipelago.
zh_cn: 很久以前，它上面居住着与群岛其他各处很像的农民和渔夫。

source: They sailed brightly painted boats and were known for being excellent divers.
zh_cn: 他们乘着漆有明亮色彩的船航行，因为是极好的潜水者而闻名。

source: Their beaches were rarely empty and even at night there were often fires in the dunes and people in the water, enjoying a swim.
zh_cn: 他们的海滩很少是空着的，即使在晚上沙丘中也经常有火光，还有人在水中畅游。

source: An offshore beacon on the north side, which warned sailors of a treacherous ridge of rocks, was tended by the islanders, who never let it go out.
zh_cn: 北面的一座近海灯塔，提醒海员们注意充满危险的暗礁海脊，由岛上居民照管，他们从不让它熄灭。

source: Goats were kept on the upland slopes, their bells tinkling as they grazed.
zh_cn: 山羊被放养在高地的斜坡上，吃草时它们的铃铛叮当作响。

source: The people were fond of seafood and sun- bathing, were enthusiastic winemakers, reluctant housekeepers and notoriously bad at ball games.
zh_cn: 人们喜欢海食品和日光浴，他们是热情的酿酒师，不情愿的家庭主妇以及众所周知不擅长球类运动。

source: They married early, died late and generally kept themselves to themselves.
zh_cn: 他们结婚早，死得晚，一般不与他人往来。

source: Things could have gone on like this forever, but everything changed when they decided to dynamite the cliffs and began building the first wall.
zh_cn: 事情本可以这样永远继续下去，但是当他们决定炸毁悬崖并开始建造第一道围墙时，一切都变了。

source: Now their island looks very different from the rest; darker, taller, silent.
zh_cn: 现在他们的岛屿看起来与其它的非常不一样；更暗，更高，寂静无声。

source: Giant loops of barbed wire lie rusting in the surf.
zh_cn: 巨大的一圈圈的带刺铁丝网在海浪中生锈。

source: The cliffs are sheer, blasted smooth and bristling with broken glass.
zh_cn: 悬崖陡峭，被炸得光滑，竖立着碎玻璃。

source: Above them a great fortress extends the precipice way beyond its natural height.
zh_cn: 在它们上面一个大堡垒超出悬崖的天然高度沿着峭壁的方向延伸出去。

source: Slabs of granite, quarried relentlessly from the once volcanic heart of the island, make up the base of the wall.
zh_cn: 花岗岩石板，被无情地从曾经是岛上火山心的地方挖出，做成围墙的底座。

source: Smoothed flat by generations of wind and rain, they glitter in the sun.
zh_cn: 它们被一代代的风雨磨平，在阳光下闪闪发光。

source: Above them the rocks give way to brick, darker in colour than the stone foundations and topped with ramparts, unbroken and lowering.
zh_cn: 在它们上面，石头被砖头代替，颜色比石头底座更暗，上面有壁垒，完好无损且低沉昏暗。

source: It looks as if the wall was meant to end there but as soon as it was finished a second circle of battlements began to rise from the centre.
zh_cn: 看上去好像这道围墙打算就此结束了，但它一完成，第二圈城垛开始从中心升起来。

source: This one was interspersed with watchtowers, which, as far as anyone knows, were never used.
zh_cn: 这道墙配置有瞭望塔，但众所周知，这些从未用过。

source: When it was finished, yet a third ring of defences was built, slightly narrower than the one before, so that from faraway the island resembled an enormous wedding cake.
zh_cn: 然而当它完工时，又建了第三圈防御工事，比前一个稍微狭小些，所以从远处看，这个岛象一个巨大的婚礼蛋糕。

source: Caged in scaffolding, the beginnings of a fourth wall are just visible at the top but unlike the rest, its edges are jagged and crumbling.
zh_cn: 被脚手架像笼子一样困着的第四道围墙已经开始建造，刚好可以看见它的顶部，但与其它的不同，它的边缘参差不齐而且正在剥落。

source: The surrounding islanders cannot say for sure why the wall was built.
zh_cn: 周围的岛上居民说不准为什么要建围墙。

source: Nobody was planning an assault of any kind, nor was anyone powerful enough to pose a threat with enough strength to justify such a fortress.
zh_cn: 没有人计划任何形式的攻击，也没有任何人强大到足以造成有足够威力的威胁来证明这样的堡垒是必要的。

source: There were no rumours of an attack from overseas, although the people admit that while the wall was under construction, they had grown nervous.
zh_cn: 也没有海外来袭的谣言，虽然人们承认墙在建造时他们渐渐变得紧张。

source: Perhaps the builders had heard of a new, formidable enemy that they had not.
zh_cn: 可能建造者听说了一个他们没有听说过的新的、强大的敌人。

source: They felt uneasy, as if they too should be taking special precautions but against what, they had no idea.
zh_cn: 他们感到不安，好像他们也应该采取特殊的预防措施，但要抵抗什么，他们不知道。

source: As the work intensified, so did their alarm.
zh_cn: 随着工程加强，他们的警觉也加强了。

source: But they had crops to plant, cattle to feed, children to care for and pleasures to seek.
zh_cn: 但他们有庄稼要种，有牲口要喂养，有孩子要照料，有乐子要找。

source: Despite their bewilderment, the people of the archipelago got on with their lives and watched in wonder as year after year the fortress grew, until the low clouds grazed its upper reaches and its blackened walls seemed to swallow the sunshine; a broken crown in the deep blue sea.
zh_cn: 他们虽然困惑，但随着一年又一年堡垒逐渐建成，群岛上的人继续过他们的生活，疑惑地看着，直到低矮的云掠过它的顶端，它那发黑的墙好像要吞掉阳光；深蓝色大海上一顶坏掉的王冠。

source: Gradually the island fell silent.
zh_cn: 渐渐地这个岛变得沉寂。

source: First, trade petered out and then ceased altogether.
zh_cn: 首先，贸易逐渐减少，然后完全终结。

source: Onlookers muttered that with so much time spent on the wall, the builders simply had nothing left to sell.
zh_cn: 旁观者嘀咕说，这么多时间花在围墙上，建造者只不过没剩下什么要卖的东西了。

source: Next, the fishing boats stopped sailing from the ports, then the hearth smoke faded away and only a sandy haze was left hanging in the air; a death rattle of dust.
zh_cn: 接着，渔船停止从港口启航，然后炉烟逐渐消逝，只剩下一层沙色的薄雾悬在空中；尘埃的临死哀鸣。

source: Last of all to disappear were the sounds of building; the echo of brick on brick and the continual whine of pulleys.
zh_cn: 最后消失的是建造的声音；砖头碰砖头的回声和连续不断的滑车的嘎嘎声。

source: Nobody can explain why the wall was started but there are many theories as to why it was never finished.
zh_cn: 没有人能解释为什么开始建造围墙，但对于它为什么从未完工却有许多说法。

source: Some say that so many had perished during its construction, that no one dared halt the work and thereby admit that it had all been in vain.
zh_cn: 有些人说在建造的过程中毁坏了这么多，使得没人敢停下工程并从而承认它全是徒然。

source: Others claim that the builders simply ran out of materials and since they had scooped so much rock from the centre of the island, there was no land left to plough.
zh_cn: 还有些人声称建造者只是用光了材料，因为他们从岛中心挖了这么多石头，没有可耕耘的土地了。

source: There are those who believe that the bricks near the top of the wall are made from the baked bones of labourers who dropped from exhaustion further down.
zh_cn: 还有人认为靠近墙顶的砖是由烘烤的劳工的骨头制成的，这些劳工由于精疲力竭而跌落到更深的下面。

source: Or perhaps the islanders grew so used to the work that they just couldn't stop themselves.
zh_cn: 或者是岛上居民可能变得太习惯这个工程了，以至于他们完全阻止不了自己。

source: But one thing is certain, the prophesied threat never arrived and the people at the centre of the archipelago had, quite simply, bricked themselves in.
zh_cn: 但有一件事是确定的，那个预言的威胁从未到来，群岛中心的人只不过是用砖头把自己砌在了里面。
